Tekla.Structures.Geometry3d.ArcConversions
The Tekla.Structures.Geometry3d.ArcConversions class converts structures representing arcs
from Tekla.Structures.Geometry3d to Tekla.Common.Geometry and back.

Tekla.Structures.Geometry3d.ArcConversions.ToArc3(Tekla.Structures.Geometry3d.Arc)
Converts a Tekla.Structures.Geometry3d.Arc to a Tekla.Common.Geometry.Arc3.
arc: The Tekla.Structures.Geometry3d.Arc to convert.
Returns: The resulting Tekla.Common.Geometry.Arc3.

Tekla.Structures.Geometry3d.ArcConversions.ToArc(Tekla.Common.Geometry.Arc3)
Converts a Tekla.Common.Geometry.Arc3 to a Tekla.Structures.Geometry3d.Arc.
arc: The Tekla.Common.Geometry.Arc3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Arc.